app/views/books/_like.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."book_id" = ?  [["book_id", 2]]
---
      <% end %>
      <% unless book.likes.count == 0 %>