app/controllers/books_controller.rb

  def index
      # params[:q]['title_or_body_cont_all'] = params[:q]['title_or_body_cont_all'].split(/[\p{blank}\s]+/)
      # binding.pry
      @words = params[:q].delete(:title_or_body_cont) if params[:q].present?
     if @words.present?
      params[:q][:groupings] = []
      @words.split(/[ 　]/).each_with_index do |word, i| #全角空白と半角空白で切って、単語ごとに処理します
      params[:q][:groupings][i] = { title_or_body_cont: word }
       end
     end
      @q = Book.ransack(params[:q])
      @books = @q.result.page(params[:page]).reverse_order
---
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]

  def show
      @bookl = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
      @book = Book.new(book_params)
      @book.user_id = current_user.id
    if @book.save
      flash[:message] = "投稿を作成しました"
      redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "sss"], ["body", "sss"], ["created_at", "2018-05-18 04:43:36.360172"], ["updated_at", "2018-05-18 04:43:36.360172"], ["user_id", 1]]
SELECT "books".* FROM "books"