app/controllers/likes_controller.rb

  def create
     @book = Book.find(params[:book_id])
     @like = Like.create(user_id: current_user.id, book_id: params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["book_id", 2], ["created_at", "2018-07-09 06:53:40.451131"], ["updated_at", "2018-07-09 06:53:40.451131"]]

  def destroy
    @book = Book.find(params[:book_id])
    like = Like.find_by(user_id: current_user.id, book_id: params[:book_id]).destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 2], ["LIMIT", 1]]