app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @users = User.all
    @book = Book.new
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "intro" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "タコす"], ["profile_image_id", "add3e9f96ea7e2bf69e849fb81d074e1997bae40896376c3d46b94183053"], ["intro", "イントロダクション！"], ["updated_at", "2018-05-18 11:07:14.352947"], ["id", 1]]
---
  def update
  	@user = User.find(params[:id])
  	@user.update(user_params)